ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore_peripherals.h
/*

Copyright (c) 2010 - 2024, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF7140_WIFICORE_PERIPHERALS_H
#define NRF7140_WIFICORE_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*User information configuration registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

#define UICR_FEATEN_RADIO_ON 0                       /*!< (unspecified)                                                        */
#define UICR_FEATEN_WIFI_ON 1                        /*!< (unspecified)                                                        */
#define UICR_FEATEN_LTE_ON 0                         /*!< (unspecified)                                                        */

/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 5

#define VPRLMAC_INIT_PC_RESET_VALUE 0x00000000       /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPRLMAC_VPR_START_RESET_VALUE 0              /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPRLMAC_RAM_BASE_ADDR 0x28000000             /*!< VPR RAM base address (RAM_BASE_ADDR): 0x28000000                     */
#define VPRLMAC_RAM_SZ 18                            /*!< VPR RAM size (RAM_SZ): 18 (Value in bytes is computed as 2^(RAM
                                                          size))*/
#define VPRLMAC_VPRSAVEDCTX_REGNAME NRF_WIFICORE_MEMCONF->POWER[0].RET /*!< (unspecified)                                      */
#define VPRLMAC_VPRSAVEDCTX_REGBIT 0                 /*!< (unspecified)                                                        */
#define VPRLMAC_RETAINED 0                           /*!< Retain registers in Deep Sleep mode: 0                               */
#define VPRLMAC_VPRSAVEDCTX 1                        /*!< (unspecified)                                                        */
#define VPRLMAC_VPRSAVEADDR 0x28040000               /*!< VPR context save address: 0x28040000                                 */
#define VPRLMAC_VPRREMAPADDRVTOB 0x00000000          /*!< VPR remap address: 0x00000000                                        */
#define VPRLMAC_VEVIF_NTASKS_MIN 0                   /*!< VEVIF tasks: 0..7                                                    */
#define VPRLMAC_VEVIF_NTASKS_MAX 7                   /*!< VEVIF tasks: 0..7                                                    */
#define VPRLMAC_VEVIF_NTASKS_SIZE 8                  /*!< VEVIF tasks: 0..7                                                    */
#define VPRLMAC_VEVIF_TASKS_MASK 0xFFFFFFFF          /*!< Mask of supported VEVIF tasks: 0xFFFFFFFF                            */
#define VPRLMAC_VEVIF_NDPPI_MIN 0                    /*!< VEVIF DPPI channels: 0..0                                            */
#define VPRLMAC_VEVIF_NDPPI_MAX 0                    /*!< VEVIF DPPI channels: 0..0                                            */
#define VPRLMAC_VEVIF_NDPPI_SIZE 1                   /*!< VEVIF DPPI channels: 0..0                                            */
#define VPRLMAC_VEVIF_NEVENTS_MIN 0                  /*!< VEVIF events: 0..0                                                   */
#define VPRLMAC_VEVIF_NEVENTS_MAX 0                  /*!< VEVIF events: 0..0                                                   */
#define VPRLMAC_VEVIF_NEVENTS_SIZE 1                 /*!< VEVIF events: 0..0                                                   */
#define VPRLMAC_DEBUGGER_OFFSET 1024                 /*!< Debugger interface register offset: 0x48000400                       */

#define VPRUMAC_INIT_PC_RESET_VALUE 0x00000000       /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPRUMAC_VPR_START_RESET_VALUE 0              /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPRUMAC_RAM_BASE_ADDR 0x28100000             /*!< VPR RAM base address (RAM_BASE_ADDR): 0x28100000                     */
#define VPRUMAC_RAM_SZ 19                            /*!< VPR RAM size (RAM_SZ): 19 (Value in bytes is computed as 2^(RAM
                                                          size))*/
#define VPRUMAC_VPRSAVEDCTX_REGNAME NRF_WIFICORE_MEMCONF->POWER[0].RET /*!< (unspecified)                                      */
#define VPRUMAC_VPRSAVEDCTX_REGBIT 1                 /*!< (unspecified)                                                        */
#define VPRUMAC_RETAINED 0                           /*!< Retain registers in Deep Sleep mode: 0                               */
#define VPRUMAC_VPRSAVEDCTX 1                        /*!< (unspecified)                                                        */
#define VPRUMAC_VPRSAVEADDR 0x28040180               /*!< VPR context save address: 0x28040180                                 */
#define VPRUMAC_VPRREMAPADDRVTOB 0x00000000          /*!< VPR remap address: 0x00000000                                        */
#define VPRUMAC_VEVIF_NTASKS_MIN 0                   /*!< VEVIF tasks: 0..7                                                    */
#define VPRUMAC_VEVIF_NTASKS_MAX 7                   /*!< VEVIF tasks: 0..7                                                    */
#define VPRUMAC_VEVIF_NTASKS_SIZE 8                  /*!< VEVIF tasks: 0..7                                                    */
#define VPRUMAC_VEVIF_TASKS_MASK 0xFFFFFFFF          /*!< Mask of supported VEVIF tasks: 0xFFFFFFFF                            */
#define VPRUMAC_VEVIF_NDPPI_MIN 0                    /*!< VEVIF DPPI channels: 0..0                                            */
#define VPRUMAC_VEVIF_NDPPI_MAX 0                    /*!< VEVIF DPPI channels: 0..0                                            */
#define VPRUMAC_VEVIF_NDPPI_SIZE 1                   /*!< VEVIF DPPI channels: 0..0                                            */
#define VPRUMAC_VEVIF_NEVENTS_MIN 0                  /*!< VEVIF events: 0..0                                                   */
#define VPRUMAC_VEVIF_NEVENTS_MAX 0                  /*!< VEVIF events: 0..0                                                   */
#define VPRUMAC_VEVIF_NEVENTS_SIZE 1                 /*!< VEVIF events: 0..0                                                   */
#define VPRUMAC_DEBUGGER_OFFSET 1024                 /*!< Debugger interface register offset: 0x48004400                       */

