ankuns/nrfx/bsp/stable/mdk/nrf7140_wificore_peripherals.h
/*Antenna switch controller*/
#define ANTSWC_PRESENT 1
#define ANTSWC_COUNT 1

#define ANTSWC_NRADIOS 2                             /*!< Number of radio ports : 2                                            */
#define ANTSWC_NANTSWBITS 1                          /*!< Number of antenna switch control bits: 1                             */
#define ANTSWC_ANTSWC_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define ANTSWC_ANTSWC_NUM_CLOCK_POWER_PAIR_MAX 1     /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define ANTSWC_ANTSWC_NUM_CLOCK_POWER_PAIR_SIZE 2    /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define ANTSWC_ANTSWC_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define ANTSWC_DPPI_ENABLE_REGISTERS 0               /*!< (unspecified)                                                        */

/*Cross-Trigger Interface control*/
#define CTI_PRESENT 1
#define CTI_COUNT 3

/*RESETINFO*/
#define RESETINFO_PRESENT 1
#define RESETINFO_COUNT 1

#define RESETINFO_HASRESETREAS 1                     /*!< (unspecified)                                                        */
#define RESETINFO_CROSSDOMAINRESET 0                 /*!< (unspecified)                                                        */

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 2

#define MEMCONF_RETTRIM 1                            /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR 0                             /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR_INTERNAL_DOC 0                /*!< (unspecified)                                                        */
#define MEMCONF_POWER 1                              /*!< (unspecified)                                                        */
#define MEMCONF_RET2 1                               /*!< (unspecified)                                                        */
#define MEMCONF_RETAIN_PUBLIC_DOC 1                  /*!< (unspecified)                                                        */
#define MEMCONF_RETAIN_INTERNAL_DOC 0                /*!< (unspecified)                                                        */
#define MEMCONF_TRIM_INTERNAL_DOC 0                  /*!< (unspecified)                                                        */

#define MEMCONF310_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF310_REPAIR 0                          /*!< (unspecified)                                                        */
#define MEMCONF310_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF310_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF310_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF310_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF310_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF310_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

/*RPURFBUS*/
#define RPURFBUS_PRESENT 1
#define RPURFBUS_COUNT 1

/*BELLBOARD APB registers*/
#define BELLBOARD_PRESENT 1
#define BELLBOARD_COUNT 1

#define BELLBOARD_IRQ_COUNT 4

/*WIFICore RPU MAC peripherals*/
#define WIFIMAC_PRESENT 1
#define WIFIMAC_COUNT 1

/*WIFICore RPU PHY peripherals*/
#define WIFIPHY_PRESENT 1
#define WIFIPHY_COUNT 1

/*RPUPBUS*/
#define RPUPBUS_PRESENT 1
#define RPUPBUS_COUNT 1

/*RPUQM*/
#define RPUQM_PRESENT 1
#define RPUQM_COUNT 1

/*RPUHPQM*/
#define RPUHPQM_PRESENT 1
#define RPUHPQM_COUNT 1

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

#define FICR_LTE_ON 0                                /*!< (unspecified)                                                        */
#define FICR_WIFI_ON 1                               /*!< (unspecified)                                                        */
#define FICR_NFC_ON 1                                /*!< (unspecified)                                                        */
#define FICR_ML_ON 1                                 /*!< (unspecified)                                                        */
#define FICR_SDCARD_ON 1                             /*!< (unspecified)                                                        */
#define FICR_VREG_1V8_0V8 1                          /*!< (unspecified)                                                        */
#define FICR_AUDIO_USB_PROGRAMMABLE_OWNER 1          /*!< (unspecified)                                                        */

/*USBHSCORE*/
#define USBHSCORE_PRESENT 1
#define USBHSCORE_COUNT 1

/*I3CCORE*/
#define I3CCORE_PRESENT 1
#define I3CCORE_COUNT 2

/*DMU*/
#define DMU_PRESENT 1
#define DMU_COUNT 2

/*MCAN*/
#define MCAN_PRESENT 1
#define MCAN_COUNT 2

/*System Trace Macrocell data buffer*/
#define STMDATA_PRESENT 1
#define STMDATA_COUNT 1

/*TDDCONF*/
#define TDDCONF_PRESENT 1
#define TDDCONF_COUNT 1

#define TDDCONF_FEATEN_TDDCONF_CLK_320MHZ 1          /*!< (unspecified)                                                        */
#define TDDCONF_FEATEN_TDDCONF_CLK_400MHZ 0          /*!< (unspecified)                                                        */

/*Timestamp generator*/
#define TSGEN_PRESENT 1
#define TSGEN_COUNT 1

/*System Trace Macrocell*/
#define STM_PRESENT 1
#define STM_COUNT 1

/*Trace Port Interface Unit*/
#define TPIU_PRESENT 1
#define TPIU_COUNT 1

/*Embedded Trace Buffer*/
#define ETB_PRESENT 1
#define ETB_COUNT 1

/*Embedded Trace Router*/
#define ETR_PRESENT 1
#define ETR_COUNT 1

